In [3]:
import pandas as pd

In [4]:
data = pd.read_csv('D:\\Netology\\10 Pandas\\ml-latest-small\\ml-latest-small\\ratings.csv')
data.head()
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100836 entries, 0 to 100835
Data columns (total 4 columns):
 #   Column     Non-Null Count   Dtype
---  ------     --------------   -----
 0   userId     100836 non-null  int64
 1   movieId    100836 non-null  int64
 2   rating     100836 non-null  float64
 3   timestamp  100836 non-null  int64
dtypes: float64(1), int64(3)
memory usage: 3.1 MB

In [16]:
res = data.loc[data['rating'] == 5].groupby(['movieId']).count().sort_values('rating', ascending=False)
res[ 'rating'].head(1)

movieId
318    153
Name: rating, dtype: int64

In [18]:
data_power = pd.read_csv('D:\\Netology\\10 Pandas\\10._Основы_pandas\\power.csv')
data_power.head()

   country  year  quantity  category
0  Austria  1996       5.0         1
1  Austria  1995      17.0         1
2  Belgium  2014       0.0         1
3  Belgium  2013       0.0         1
4  Belgium  2012      35.0         1

In [23]:

data_power[ data_power['country'].str.contains('Lit', case=False) | data_power['country'].str.contains('Lat', case=False) | data_power['country'].str.contains('Estonia', case=False)]['country'].unique()

array(['Lithuania', 'Latvia', 'Estonia'], dtype=object)

In [37]:
filtered_country = data_power.loc[(data_power['country'] == 'Latvia') | (data_power['country'] == 'Lithuania') | (data_power['country'] == 'Estonia')]
filtered_category = filtered_country.loc[(filtered_country['category'] == 4) | (filtered_country['category'] == 12) | (filtered_country['category'] == 21)]
filtered_year = filtered_category.loc[(filtered_category.year >= 2005) & (filtered_category.year <= 2010)]
filtered_year.head()

         country  year  quantity  category
10617    Estonia  2008       1.0         4
10618    Estonia  2007       0.0         4
10619    Estonia  2006       0.0         4
10620    Estonia  2005       1.0         4
11156  Lithuania  2008       1.0         4

In [40]:
res = filtered_year.loc[filtered_year.quantity > 0].sum()
print(res['quantity'])

240580.0

In [46]:
page_url = 'https://www.finanz.ru/valyuty/v-realnom-vremeni'
dhtml =  pd.read_html(page_url,  encoding='utf-8')
dhtml[0]

,0,1,2,3,4,5,6,7,8,9,10,11
0,ММВБ,3 186,"-2,7%",Nasdaq,12 743,"-0,1%",Биткойн,23 041,"0,9%",USD/RUB,748907,"0,4%"
1,РТС,1 336,"-4,8%",S&P500,3 695,"-0,4%",Нефть,507,"-0,2%",EUR/RUB,915810,"0,2%"
2,Dow,30 216,"0,1%",FTSE100,6 416,"-1,7%",Золото,1 881,"0,2%",EUR/USD,12227,"-0,1%"